tap "authzed/tap"
tap "buo/cask-upgrade"
tap "cockroachdb/tap"
tap "derailed/k9s"
tap "github/bootstrap"
tap "golangci/tap"
tap "goles/battery"
tap "heroku/brew"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "tidbyt/tidbyt"
tap "universal-ctags/universal-ctags"
tap "vitorgalvao/tiny-scripts"
tap "wata727/tflint"
# Run your GitHub Actions locally
brew "act"
# Simple, modern, secure file encryption
brew "age"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Configuration editing tool and API
brew "augeas"
# Text processing system for reStructuredText
brew "docutils"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Collection of portable C++ source libraries
brew "boost"
# Cryptographic algorithms and formats library in C++
brew "botan"
# Tools to bootstrap CAs, certificate requests, and signed certificates
brew "certstrap"
# CloudFlare's PKI toolkit
brew "cfssl"
# Checks for bashisms in shell scripts
brew "checkbashisms"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# Diff your Docker containers
brew "container-diff"
# Tool for browsing source code
brew "cscope"
# Tool to perform numerical, textual & statistical operations
brew "datamash"
# Kubernetes command-line interface
brew "kubernetes-cli"
# CLI helps develop/deploy/debug apps with Docker and k8s
brew "devspace"
# Display user-friendly message boxes from shell scripts
brew "dialog"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Tool for managing dock items
brew "dockutil"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Dark color theme available for a number of editors
brew "emacs-dracula"
# Run arbitrary commands when files change
brew "entr"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Program that can automate interactive applications
brew "expect"
# Simple, fast and user-friendly alternative to find
brew "fd"
# NaCl networking and cryptography library
brew "libsodium"
# Framework for layout and rendering of i18n text
brew "pango"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh", args: ["HEAD"]
# Interpreter for PostScript and PDF
brew "ghostscript"
# Simple gRPC benchmarking and load testing tool
brew "ghz"
# Play, record, convert, and stream audio and video
brew "ffmpeg", args: ["HEAD"]
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Database migrations CLI tool
brew "golang-migrate"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# GNU grep, egrep and fgrep
brew "grep"
# Like cURL, but for gRPC
brew "grpcurl"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Post-modern modal text editor
brew "helix"
# Kubernetes package manager
brew "helm"
# Process manager for Procfile-based applications
brew "hivemind"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie", link: false
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Command-line pager for JSON data
brew "jless"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line note taker
brew "jrnl"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Bind to privileged ports without running a server as root
brew "launch_socket_server"
# Mini DNS server designed solely to route queries to localhost
brew "launchdns"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Let's Encrypt client and ACME library
brew "lego"
# Provides unified data access to the GNOME project
brew "libgda"
# Collection library providing GObject-based interfaces
brew "libgee"
# GNOME XML library
brew "libxml2"
# XML security library
brew "libxmlsec1"
# Command-line utility to interact with linkerd
brew "linkerd"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Mac App Store command-line interface
brew "mas"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Cross-platform application and UI framework
brew "qt"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# C library for multiple-precision floating-point computations
brew "mpfr"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Open source relational database management system
brew "mysql-client"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Open source relational database management system
brew "mysql@5.7"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Install NodeJS versions
brew "node-build"
# Platform built on V8 to build network applications
brew "node@14"
# Manage multiple NodeJS versions
brew "nodenv"
# Libraries for security-enabled client and server applications
brew "nss"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# SDK for building Kubernetes applications
brew "operator-sdk"
# OCI Registry As Storage
brew "oras"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Simplistic interactive filtering tool
brew "peco"
# Display the PID number for a given process name
brew "pidof"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Show ps output as a tree
brew "pstree"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Rakudo compiler and commonly used packages
brew "rakudo-star"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Fast, efficient and secure backup program
brew "restic"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wraps rm to prevent dangerous deletion of files
brew "safe-rm"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SOcket CAT: netcat on steroids
brew "socat"
# Cryptographic store accessible through a PKCS#11 interface
brew "softhsm"
# Sparklines for the shell
brew "spark"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Version control system designed to be a better CVS
brew "subversion"
# Feature-rich console based todo list manager
brew "task"
# Shell wrapper for Taskwarrior commands
brew "tasksh"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Linter for Terraform files
brew "tflint"
# Code-search similar to ack
brew "the_silver_searcher"
# Command-line time tracking application
brew "timewarrior"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# File synchronization tool
brew "unison"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# YubiKey personalization library and tool
brew "ykpers"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
# Play, record, convert, and stream audio and video
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["HEAD"]
# App runtime and UX toolkit for pixel-based apps.
brew "tidbyt/tidbyt/pixlet"
# Quickly repair outdated/broken Casks from homebrew-cask
brew "vitorgalvao/tiny-scripts/cask-repair"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Application uninstaller
cask "appcleaner"
# Data management tool that enables working with SQL Server
cask "azure-data-studio"
# Record and process your ideas
cask "bike"
# Virtual Audio Driver
cask "blackhole-16ch"
# Opensource IDE for exploring and testing api's
cask "bruno"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Use your phone as a high-quality webcam with image tuning controls
cask "camo-studio"
# Server and cloud storage browser
cask "cyberduck"
# API documentation browser and code snippet manager
cask "dash"
# Presentations from Markdown
cask "deckset"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# Web browser
cask "firefox"
cask "font-fira-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-for-powerline-bold"
# Expressive monospaced font family
cask "font-intel-one-mono"
cask "font-lato"
cask "font-menlo-for-powerline"
cask "font-meslo-lg"
cask "font-oxygen"
cask "font-oxygen-mono"
# Font with a mechanical skeleton and the forms are largely geometric
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-slab"
cask "font-share-tech"
cask "font-share-tech-mono"
cask "font-source-code-pro"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Light, Electron-based Wrapper around GraphiQL
cask "graphiql"
# Open-source video transcoder
cask "handbrake"
# Command-line backup program
cask "hashbackup"
# Link and retrieve key information
cask "hookmark"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source screen recorder built with web technology
cask "kap"
# End-to-end encryption software
cask "keybase"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Kubernetes IDE
cask "lens"
# Software for Logitech devices
cask "logitech-options"
# Utility for pairing devices with Unifying receivers
cask "logitech-unifying"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Text editor
cask "macvim"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Note taking app
cask "nvalt"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# CPAP Analysis Reporter
cask "oscar"
# HTTP client that helps testing and describing APIs
cask "paw"
# Collaboration platform for API development
cask "postman"
# QuickLook plugin to view patch files
cask "qlprettypatch"
# QuickLook plugin for JSON files
cask "quicklook-json"
# Modern programming language in the Lisp/Scheme family
cask "racket"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Notepad software
cask "scapple"
# Store SSH keys in the Secure Enclave
cask "secretive"
# Video editor
cask "shotcut"
# Screenshot measurement and annotation tool
cask "shottr"
# Instant messaging application focusing on security
cask "signal"
cask "soundcleod"
# Video game digital distribution service
cask "steam"
# Task manager for teams
cask "taskade"
# Open-source code editor
cask "visual-studio-code"
# Code editor
cask "visual-studio-code-insiders"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Network protocol analyzer
cask "wireshark"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
# YubiKey tool
cask "yubico-yubikey-personalization-gui"
# Application for configuring a PIV-enabled YubiKey
cask "yubico-yubikey-piv-manager"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Affinity Designer", id: 824171161
mas "AS Timer", id: 512464723
mas "Bear", id: 1091189122
mas "Boop", id: 1518425043
mas "Craft", id: 1487937127
mas "DaVinci Resolve", id: 571213070
mas "Drafts", id: 1435957248
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "HazeOver", id: 430798174
mas "iMovie", id: 408981434
mas "Ka-Block!", id: 1335413823
mas "Keynote", id: 409183694
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Okta Extension App", id: 1439967473
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pinboard Tools", id: 1552590875
mas "Pixelmator", id: 407963104
mas "Playgrounds", id: 1496833156
mas "Remote Desktop", id: 409907375
mas "Sequel Ace", id: 1518036000
mas "Slack", id: 803453959
mas "SomaFM", id: 449155338
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "Tot", id: 1491071483
mas "Xcode", id: 497799835
vscode "42Crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "arr.marksman"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "cmstead.js-codeformer"
vscode "CraigMaslowski.erb"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "dotenv.dotenv-vscode"
vscode "DotJoshJohnson.xml"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "dracula-theme.theme-dracula"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-codeql"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hbenl.vscode-test-explorer"
vscode "humao.rest-client"
vscode "kaiwood.endwise"
vscode "KoichiSasada.vscode-rdbg"
vscode "manuelpuyol.erb-linter"
vscode "misogi.ruby-rubocop"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "neverik.go-critic"
vscode "qezhu.gitlink"
vscode "redhat.vscode-yaml"
vscode "RichardKotze.git-mob"
vscode "Shopify.ruby-extensions-pack"
vscode "Shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sorbet.sorbet-vscode-extension"
vscode "stylelint.vscode-stylelint"
vscode "tamj0rd2.ts-quickfixes-extension"
vscode "tkcandrade.code-annotation"
vscode "tomphilbin.gruvbox-themes"
vscode "vittorioromeo.expand-selection-to-scope"
vscode "vscode-icons-team.vscode-icons"
vscode "will-wow.vscode-alternate-file"
vscode "wingrunr21.vscode-ruby"
