tap "authzed/tap"
tap "buo/cask-upgrade"
tap "cockroachdb/tap"
tap "golangci/tap"
tap "goles/battery"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"
tap "vitorgalvao/tiny-scripts"
tap "wata727/tflint"
# Simple, modern, secure file encryption
brew "age"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Configuration editing tool and API
brew "augeas"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Collection of portable C++ source libraries
brew "boost"
# Cryptographic algorithms and formats library in C++
brew "botan"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Tools to bootstrap CAs, certificate requests, and signed certificates
brew "certstrap"
# CloudFlare's PKI toolkit
brew "cfssl"
# Checks for bashisms in shell scripts
brew "checkbashisms"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# Diff your Docker containers
brew "container-diff"
# Tool for browsing source code
brew "cscope"
# Display user-friendly message boxes from shell scripts
brew "dialog"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Tool for managing dock items
brew "dockutil"
# Text processing system for reStructuredText
brew "docutils"
# Run arbitrary commands when files change
brew "entr"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Program that can automate interactive applications
brew "expect"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# NaCl networking and cryptography library
brew "libsodium"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh", args: ["HEAD"]
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Database migrations CLI tool
brew "golang-migrate"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# GNU grep, egrep and fgrep
brew "grep"
# Kubernetes package manager
brew "helm"
# Process manager for Procfile-based applications
brew "hivemind"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line note taker
brew "jrnl"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Bind to privileged ports without running a server as root
brew "launch_socket_server"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Let's Encrypt client and ACME library
brew "lego"
# Provides unified data access to the GNOME project
brew "libgda"
# GNOME XML library
brew "libxml2"
# Command-line utility to interact with linkerd
brew "linkerd"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# C library for multiple-precision floating-point computations
brew "mpfr"
# Open source relational database management system
brew "mysql-client"
# Open source relational database management system
brew "mysql@5.7", restart_service: true
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Install NodeJS versions
brew "node-build"
# Platform built on V8 to build network applications
brew "node@14"
# Manage multiple NodeJS versions
brew "nodenv"
# Libraries for security-enabled client and server applications
brew "nss"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# SDK for building Kubernetes applications
brew "operator-sdk"
# OCI Registry As Storage
brew "oras"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Simplistic interactive filtering tool
brew "peco"
# Display the PID number for a given process name
brew "pidof"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Show ps output as a tree
brew "pstree"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Rakudo compiler and commonly used packages
brew "rakudo-star"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Fast, efficient and secure backup program
brew "restic"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install various Ruby versions and implementations
brew "ruby-build"
# Wraps rm to prevent dangerous deletion of files
brew "safe-rm"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SOcket CAT: netcat on steroids
brew "socat"
# Cryptographic store accessible through a PKCS#11 interface
brew "softhsm"
# Sparklines for the shell
brew "spark"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Version control system designed to be a better CVS
brew "subversion"
# Feature-rich console based todo list manager
brew "task"
# Shell wrapper for Taskwarrior commands
brew "tasksh"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Linter for Terraform files
brew "tflint"
# Code-search similar to ack
brew "the_silver_searcher"
# Command-line time tracking application
brew "timewarrior"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# File synchronization tool for OSX
brew "unison"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# YubiKey personalization library and tool
brew "ykpers"
# Process YAML documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# manage Authzed from your command line.
brew "authzed/tap/zed"
# Distributed SQL database
brew "cockroachdb/tap/cockroach"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
# Quickly repair outdated/broken Casks from homebrew-cask
brew "vitorgalvao/tiny-scripts/cask-repair"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Application uninstaller
cask "appcleaner"
# Text editor
cask "atom"
# Utility that prevents the system from going to sleep
cask "caffeine"
# API documentation browser and code snippet manager
cask "dash"
cask "deckset"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Web browser
cask "firefox"
cask "font-fira-mono"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-for-powerline-bold"
cask "font-lato"
cask "font-menlo-for-powerline"
cask "font-meslo-lg"
cask "font-oxygen"
cask "font-oxygen-mono"
# Font with a mechanical skeleton and the forms are largely geometric
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-slab"
cask "font-share-tech"
cask "font-share-tech-mono"
cask "font-source-code-pro"
# Go (golang) IDE
cask "goland"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Light, Electron-based Wrapper around GraphiQL
cask "graphiql"
# Open-source video transcoder
cask "handbrake"
# Command-line backup program
cask "hashbackup"
# HTTP and GraphQL Client
cask "insomnia"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source screen recorder built with web technology
cask "kap"
# End-to-end encryption software
cask "keybase"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Software for Logitech devices
cask "logitech-options"
# Utility for pairing devices with Unifying receivers
cask "logitech-unifying"
# Text editor
cask "macvim"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Note taking app
cask "nvalt"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# HTTP client that helps testing and describing APIs
cask "paw"
# Collaboration platform for API development
cask "postman"
cask "qlprettypatch"
cask "quicklook-json"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Store SSH keys in the Secure Enclave
cask "secretive"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Video editor
cask "shotcut"
# Instant messaging application focusing on security
cask "signal"
cask "soundcleod"
# Development environment
cask "vagrant"
# VPN client for secure internet access and private browsing
cask "viscosity"
# Open-source code editor
cask "visual-studio-code"
# Code editor
cask "visual-studio-code-insiders"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
# YubiKey tool
cask "yubico-yubikey-personalization-gui"
# Application for configuring a PIV-enabled YubiKey
cask "yubico-yubikey-piv-manager"
# Video communication and virtual meeting platform
cask "zoom"
mas "Affinity Designer", id: 824171161
mas "Bear", id: 1091189122
mas "Boop", id: 1518425043
mas "Drafts", id: 1435957248
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "HazeOver", id: 430798174
mas "iMovie", id: 408981434
mas "Ka-Block!", id: 1335413823
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Okta Extension App", id: 1439967473
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pinboard Tools", id: 1552590875
mas "Pixelmator", id: 407963104
mas "Playgrounds", id: 1496833156
mas "Remote Desktop", id: 409907375
mas "Slack", id: 803453959
mas "SomaFM", id: 449155338
mas "Tot", id: 1491071483
mas "Xcode", id: 497799835
