tap "fisherman/tap"
tap "github/bootstrap"
tap "goles/battery"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/completions"
tap "homebrew/core"
tap "homebrew/dev-tools"
tap "homebrew/services"
cask "java"
brew "ack"
brew "libyaml"
brew "ansible"
brew "augeas"
brew "autoconf"
brew "automake"
brew "python"
brew "awscli"
brew "bfg"
brew "boost"
brew "botan"
brew "libtool"
brew "cfssl"
brew "checkbashisms"
brew "cli53"
brew "cmake"
brew "colordiff"
brew "cowsay"
brew "cscope"
brew "dialog"
brew "direnv"
brew "elixir"
brew "elixir-build"
brew "entr"
brew "exenv"
brew "exercism"
brew "figlet"
brew "fish"
brew "fzf"
brew "gettext"
brew "mpfr"
brew "gawk"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "glib"
brew "gnu-sed"
brew "grep"
brew "go"
brew "glide"
brew "gnupg"
brew "grc"
brew "icu4c"
brew "heroku"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jansson"
brew "jemalloc"
brew "oniguruma"
brew "jq"
brew "jrnl"
brew "lcov"
brew "libevent"
brew "libgda"
brew "libxml2"
brew "lnav"
brew "macvim", args: ["with-override-system-vim"]
brew "md5sha1sum"
brew "nmap"
brew "node-build"
brew "nodenv"
brew "oath-toolkit"
brew "packer"
brew "peco"
brew "pidof"
brew "pinentry-mac"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby-build"
brew "rbenv"
brew "rbenv-bundler"
brew "rbenv-default-gems"
brew "rbenv-gemset"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "shellcheck"
brew "slackcat"
brew "socat"
brew "softhsm"
brew "spark"
brew "ssh-copy-id"
brew "stow"
brew "terragrunt"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unison"
brew "unixodbc"
brew "utf8proc"
brew "wget"
brew "wireshark"
ebrew "fisherman/tap/fisherman", args: ["HEAD"]
brew "goles/battery/battery"
cask "1password"
cask "alfred"
cask "anaconda"
cask "apache-directory-studio"
cask "appcleaner"
cask "atom"
cask "betterzipql"
cask "box-sync"
cask "caffeine"
cask "cd-to"
cask "cheatsheet"
cask "dash"
cask "dropbox"
cask "encryptme"
cask "etcher"
cask "firefox"
cask "flux"
cask "font-droid-sans-mono"
cask "font-fira-mono"
cask "font-inconsolata"
cask "font-input"
cask "font-lato"
cask "font-meslo-lg"
cask "font-oxygen"
cask "font-oxygen-mono"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-slab"
cask "font-share-tech"
cask "font-share-tech-mono"
cask "font-source-code-pro"
cask "font-ubuntu-mono-powerline"
cask "github-desktop"
cask "google-chrome"
cask "google-cloud-sdk"
cask "graphiql"
cask "hewlettpackardprinterdrivers"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "karabiner"
cask "keybase"
cask "knockknock"
cask "licecap"
cask "logitech-unifying"
cask "ngrok"
cask "nvalte"
cask "postman"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "racket"
cask "slack"
cask "spectacle"
cask "steam"
cask "vagrant"
cask "virtualbox"
cask "viscosity"
cask "vlc"
cask "vmware-fusion"
cask "webpquicklook"
cask "wireshark"
cask "yubico-authenticator"
cask "yubikey-neo-manager"
cask "yubikey-personalization-gui"
