tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/dev-tools'
tap 'homebrew/services'
tap 'homebrew/versions'

brew 'ack'
brew 'archey'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'cfssl'
brew 'cowsay'
brew 'checkbashisms'
brew 'colordiff'
brew 'dialog'
brew 'erlang'
brew 'elixir'
brew 'figlet'
brew 'fish'
brew 'gawk'
brew 'git'
brew 'go'
brew 'grc'
brew 'gpg'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'icu4c'
brew 'imagemagick'
brew 'jq'
brew 'jrnl'
brew 'lnav'
brew 'macvim', args: ['override-system-vim']
brew 'pcre'
brew 'peco'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'rbenv-readline'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ruby-build'
brew 'ssh-copy-id'
brew 'slackcat'
brew 'slugify'
brew 'the_silver_searcher'
brew 'terraform'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'zsh'

cask '1password'
# cask 'aerial'
cask 'alfred'
cask 'anaconda'
cask 'anybar'
cask 'appcleaner'
cask 'atom'
cask 'awareness'
cask 'betterzipql'
cask 'blue-jeans-browser-plugin'
cask 'box-sync'
# cask 'boxer'
# cask 'cathode'
cask 'cd-to'
cask 'cheatsheet'
cask 'cloak'
cask 'crashplan'
cask 'dash'
cask 'dropbox'
# cask 'fantastical'
cask 'firefox'
cask 'flux'
cask 'font-droid-sans-mono'
cask 'font-fira-mono'
cask 'font-inconsolata'
cask 'font-input'
cask 'font-lato'
cask 'font-meslo-lg'
cask 'font-oxygen'
cask 'font-oxygen-mono'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-roboto-slab'
cask 'font-share-tech'
cask 'font-share-tech-mono'
cask 'font-source-code-pro'
cask 'font-ubuntu-mono-powerline'
cask 'google-chrome'
cask 'hewlettpackardprinterdrivers'
cask 'iterm2'
cask 'java'
cask 'karabiner'
# cask 'lastpass'
# cask 'launchbar'
cask 'ngrok'
cask 'nvalt'
# cask 'openemu'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'screenhero'
cask 'seil'
cask 'sequel-pro'
# cask 'sizeup'
# cask 'sketch'
cask 'slack'
cask 'spectacle'
cask 'textexpander'
cask 'vagrant'
cask 'viscosity'
cask 'vlc'
cask 'vmware-fusion'
cask 'webpquicklook'
cask 'whiskey'
cask 'yubikey-neo-manager'
